{
    "weather.summary": [
        "how's the weather",
        "What's going on with the weather?",
        "Can you give me an update on the weather?",
        "How's the forecast looking today?",
        "Give me a summary of the current weather.",
        "Can you tell me the current weather?",
        "What is the weather situation at the moment?",
        "Could you provide a quick weather update?",
        "Is it raining or sunny outside?",
        "What's the weather like right now?",
        "Tell me the current weather conditions.",
        "How about the weather today?",
        "Is it a good day to be outside?",
        "What should I expect in terms of weather today?",
        "Is there any severe weather to be aware of?",
        "Can you summarize today's weather forecast?",
        "What's the weather looking like for the next few hours?",
        "Is it going to stay this way all day?",
        "Could you give me a brief overview of the weather?",
        "What's the general weather situation in our area?",
        "Is it cloudy or clear outside?",
        "Any weather alerts I should know about?",
        "How's the weather looking for outdoor activities?",
        "What's the forecast saying for today's weather?",
        "Is it going to be a warm day?",
        "Are we expecting any storms today?",
        "What's the weather condition outside my window?",
        "Is it a typical day for this season in terms of weather?",
        "how's the weather now?"
    ],

    "weather.temp": [
        "What's the temperature like right now?",
        "Can you tell me the current temperature?",
        "How hot is it outside?",
        "What's the temperature supposed to be today?",
        "What is the current temp outside?",
        "Could you tell me the outdoor temperature?",
        "Is it cold or warm outside?",
        "What's the high temperature for today?",
        "What's the low temperature expected tonight?",
        "How does the temperature feel outside?",
        "Is it going to get warmer or cooler today?",
        "What's the temperature in the shade?",
        "Can you provide the current temp in Celsius?",
        "What's the temperature in Fahrenheit right now?",
        "Is it too hot to be outside?",
        "What's the temperature like in the morning?",
        "How about the temperature in the evening?",
        "Is it warm enough to go swimming?",
        "What's the temperature in the city center?",
        "Can you tell me the temp in the nearby area?",
        "Is it below freezing outside?",
        "What's the average temperature for today?",
        "Is the temperature dropping or rising?",
        "What should I wear considering the temperature?"
    ],

    "base64.encode": [
        "Please encode this data with base64: %s",
        "I need to encode the following data in base64: %s",
        "Could you encode this string using base64? %s",
        "Convert this data to b64 encoding: %s",
        "I want to encode this information with base64: %s",
        "Help me encode this in base64: %s",
        "Can you encode this data to base64 format? %s",
        "b64 encode",
        "base64 encode",
        "encode base64 %s"
    ],

    "base64.decode": [
        "Please decode this base64 data: %s",
        "I have a base64 encoded string that needs decoding: %s",
        "Could you decode this base64 string for me? %s",
        "Convert this base64 encoded data back to its original form: %s",
        "I need to decode this base64 information: %s",
        "Help me decode this base64 data: %s",
        "Can you translate this base64 back to normal text? %s",
        "b64 decode",
        "base64 decode",
        "decode base64 %s"
    ],

    "url.encode": [
        "Please encode this URL: %s",
        "I need to encode this URL component: %s",
        "Could you encode this part of the URL? %s",
        "Convert this URL to its encoded form: %s",
        "I want to encode this URL for safe transmission: %s",
        "Help me encode this URL segment: %s",
        "Can you encode this URL data? %s"
    ],

    "url.decode": [
        "Please decode this URL: %s",
        "I have an encoded URL that needs decoding: %s",
        "Could you decode this URL for me? %s",
        "Convert this encoded URL back to its original form: %s",
        "I need to decode this URL component: %s",
        "Help me decode this URL segment: %s",
        "Can you translate this encoded URL back to normal? %s"
    ],

    "html.encode": [
        "Please encode this HTML entity: %s",
        "I need to encode this text to HTML entity: %s",
        "Could you encode this as an HTML entity? %s",
        "Convert this text to HTML entity encoding: %s",
        "I want to encode this to prevent HTML interpretation: %s",
        "Help me encode this into HTML entity: %s",
        "Can you encode this for HTML usage? %s"
    ],

    "html.decode": [
        "Please decode this HTML entity: %s",
        "I have an HTML entity that needs decoding: %s",
        "Could you decode this HTML entity for me? %s",
        "Convert this HTML entity back to its original text: %s",
        "I need to decode this HTML entity to plain text: %s",
        "Help me decode this HTML entity: %s",
        "Can you translate this HTML entity back to normal text? %s"
    ],

    "ai.command": [
        "write a typescript helloworld code",
        "Check the following content for grammar and clarity",
        "Help me study vocabulary: write a sentence for me to fill in the blank, and I'll try to pick the correct option.",
        "Improve this markdown content in asepcts like grammar and expression, for a GitHub repo README.",
        "can u think of a short name of my package",
        "simplify this code"
    ],

    "ai.answer": [
        "Which framework do you think is the most suitable for performance sensitive projects?"
    ],

    "None": [
        "free weather api",
        "js get timezone",
        "how",
        "how's",
        "how's the"
    ]
}
